#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
aws_ssm_parameter.app_context: Refreshing state... [id=/hagrid/app-context]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # aws_ssm_parameter.app_context is tainted, so must be replaced
-/+ resource "aws_ssm_parameter" "app_context" {
      ~ arn             = "arn:aws:ssm:us-east-2:949134893249:parameter/hagrid/app-context" -> (known after apply)
      ~ data_type       = "text" -> (known after apply)
      + has_value_wo    = (known after apply)
      ~ id              = "/hagrid/app-context" -> (known after apply)
      + insecure_value  = (known after apply)
      ~ key_id          = "alias/aws/ssm" -> (known after apply)
        name            = "/hagrid/app-context"
        tags            = {
            "Description" = "Auto-updated by context-updater Lambda"
            "Name"        = "hagrid-app-context"
            "Project"     = "hagrid"
        }
      ~ tier            = "Standard" -> (known after apply)
      ~ version         = 1 -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # aws_ssm_parameter.okta_credentials will be created
  + resource "aws_ssm_parameter" "okta_credentials" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Okta API credentials for app group context updater"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/hagrid/okta-credentials"
      + tags           = {
          + "Name"    = "hagrid-okta-credentials"
          + "Project" = "hagrid"
        }
      + tags_all       = {
          + "ManagedBy" = "terraform"
          + "Name"      = "hagrid-okta-credentials"
          + "Project"   = "hagrid"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # module.okta_app_group_lambda.data.archive_file.placeholder will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "placeholder" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "modules/okta_app_group_lambda/placeholder.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + type                = "zip"

      + source {
          + content  = <<-EOT
                def lambda_handler(event, context):
                    return {'statusCode': 200, 'body': 'Placeholder - update code manually'}
            EOT
          + filename = "index.py"
        }
    }

  # module.okta_app_group_lambda.aws_iam_role.lambda_role will be created
  + resource "aws_iam_role" "lambda_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "hagrid-okta-app-group-lambda-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "hagrid-okta-app-group-lambda-role"
        }
      + tags_all              = {
          + "ManagedBy" = "terraform"
          + "Name"      = "hagrid-okta-app-group-lambda-role"
          + "Project"   = "hagrid"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.okta_app_group_lambda.aws_iam_role_policy.lambda_okta_credentials will be created
  + resource "aws_iam_role_policy" "lambda_okta_credentials" {
      + id          = (known after apply)
      + name        = "hagrid-okta-lambda-credentials"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # module.okta_app_group_lambda.aws_iam_role_policy.lambda_ssm will be created
  + resource "aws_iam_role_policy" "lambda_ssm" {
      + id          = (known after apply)
      + name        = "hagrid-okta-lambda-ssm"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # module.okta_app_group_lambda.aws_lambda_function.okta_app_group_updater will be created
  + resource "aws_lambda_function" "okta_app_group_updater" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "modules/okta_app_group_lambda/placeholder.zip"
      + function_name                  = "hagrid-okta-app-group-updater"
      + handler                        = "index.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 512
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Name" = "hagrid-okta-app-group-updater"
        }
      + tags_all                       = {
          + "ManagedBy" = "terraform"
          + "Name"      = "hagrid-okta-app-group-updater"
          + "Project"   = "hagrid"
        }
      + timeout                        = 300
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "LOG_LEVEL"                 = "INFO"
              + "OKTA_CREDENTIALS_SSM_NAME" = "/hagrid/okta-credentials"
              + "SSM_PARAMETER_NAME"        = "/hagrid/app-context"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.okta_app_group_lambda.local_file.placeholder_code will be created
  + resource "local_file" "placeholder_code" {
      + content              = <<-EOT
            def lambda_handler(event, context):
                return {'statusCode': 200, 'body': 'Placeholder - update code manually'}
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "modules/okta_app_group_lambda/placeholder/index.py"
      + id                   = (known after apply)
    }

Plan: 7 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  + app_context_parameter_arn       = (known after apply)
  + lambda_function_arn             = (known after apply)
  + lambda_function_name            = "hagrid-okta-app-group-updater"
  + lambda_role_arn                 = (known after apply)
  + okta_credentials_parameter_arn  = (known after apply)
  + okta_credentials_parameter_name = "/hagrid/okta-credentials"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @m0liere, Action: `pull_request`*